from itertools import product

hello = 'Привет! Я бот помогающий твоему здоровью.'

formula = '10 х вес (кг) + 6,25 x рост (см) – 5 х возраст (г) + 5'

again = 'Рост должен быть целым числом.\nПопробуйте ещё раз: '

information = ('Поздравляю, Вы в находитесь в программе позволяющей Вам рассчитать '
               'необходимое для Вас количество калорий.\nНажмите кнопу "Рассчитать"')

product_1 = 'Название: Шейкер | Описание: что-то на спортивном | Цена: 800 руб.'
product_2 = 'Название: Cкакалка | Описание: для самых ловких | Цена: 1 700 руб.'
product_3 = 'Название: Фитнес-резинки | Описание: для самых гибких | Цена: 2 500 руб.'
product_4 = 'Название: Гантели | Описание: для самых сильных | Цена: 8 600 руб.'
