from config import *

start = 'Рады Вас приветствовать в магазине настольных игр.'


about = 'Мы продаем лучшие игры уже 2000 лет, но Вы нам не поверите, поэтому скажем, что 2 дня.'


Mgame = f'Лучший вариант для начинающих, игра небольшого размера. Стоимость {priseM}руб.'


Lgame = f'Альтернатива для тех, кто не знает что выбрать. Стоимость {priseL}руб.'


XLgame = f'Лучший набор, полный кайф. Стоимость {priseXL}руб.'


other = f'Хотите что-то другое, обратитесь к админу @MegaAdminNastolokRU.'
